package sp.phone.common;

/**
 * Created by Justwen on 2018/2/17.
 */

public interface VersionUpgradeTips {

    String TIPS_2075 = "更新内容\n"
            + "● 解决android O 通知栏无法显示被喷提醒的bug\n"
            + "● 解决镜像帖子无法打开的bug\n"
            + "● 在主题列表的选项菜单里增加子版块菜单\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2076 = "更新内容\n"
            + "● 解决重载后导航栏丢失的bug\n"
            + "● 支持直接在帖子详情里播放音频\n"
            + "● 在帖子详情页面选项菜单里增加复制当前url链接菜单\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2077 = "更新内容\n"
            + "● 支持直接在帖子详情里播放视频\n"
            + "● 更新了被喷界面的UI\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2078 = "更新内容\n"
            + "● 重新添加侧滑返回的选项\n"
            + "● 更新主题评论的布局\n"
            + "● 解决头像偶尔错乱的bug\n"
            + "● 解决无法查看附件原图的bug\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2079 = "更新内容\n"
            + "● 官方移除了踩的接口，不再支持显示踩的个数\n"
            + "● 改善夜间模式主题详情界面显示效果\n"
            + "● 现在附件不会自动加载\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2080 = "更新内容\n"
            + "● 解决部分GIF不能动的bug\n"
            + "● 解决无法添加自定义板块的bug\n"
            + "● 解决删除收藏帖子时发生的奔溃问题\n"
            + "● 解决搜索回复后页数不对的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2081 = "更新内容\n"
            + "● 解决无法登陆的问题\n"
            + "● 解决评论时间错误的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2082 = "更新内容\n"
            + "● 在主题列表增加对应的子版块名称\n"
            + "● 支持打开合集板块,暂时不支持在合集板块发帖\n"
            + "● 修复上传图片时发生崩溃的问题，增加了上传失败的提示\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2083 = "更新内容\n"
            + "● 增加一个域名选择的菜单，如果提示网络错误，可以更换其他域名\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2084 = "更新内容\n"
            + "● 修复一些在较低android版本上发生的崩溃问题\n"
            + "● 修复无法保存动图的问题\n"
            + "● 修复短消息界面域名错误的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2085 = "更新内容\n"
            + "● 修复帖子内链接无法打开的问题\n"
            + "● 修复登录后账号没有刷新的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2086 = "更新内容\n"
            + "● 支持批量浏览和下载单个楼层的所有图片\n"
            + "● 修复无法修改签名的bug\n"
            + "● 修复翻页后浮动按钮有时候无法显示的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2087 = "更新内容\n"
            + "● 支持折叠功能\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2088 = "更新内容\n"
            + "● 发帖界面增加底部工具栏\n"
            + "● 修复无法正确显示楼层被禁言的bug\n"
            + "● 修复当试图访问被删除的帖子的时候提示语错误的问题\n"
            + "● 解决无法在数据流量下屏蔽图片的bug\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2089 = "更新内容\n"
            + "● 调整默认的字体大小\n"
            + "● 更新帖子详情的UI\n"
            + "● 更新板块图标，在设置中暂时移除板块图标的选项\n"
            + "● 临时修复域名不可用的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2090 = "更新内容\n"
            + "● 修复域名不可用的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2091 = "更新内容\n"
            + "● 修复用户信息界面发生的崩溃问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2092 = "更新内容\n"
            + "● 完善内核\n"
            + "● 修复无法自动填充收信人的问题\n"
            + "● 清空我的收藏的时候增加一个对话框\n"
            + "● 可以对回复表示反对了\n"
            + "● 修复在数据流量下不显示图片的条件下，图片顺序错乱的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2093 = "更新内容\n"
            + "● 原登录界面接口被干掉了，替换了最新的接口\n"
            + "● 解决某些子版面打不开的bug\n"
            + "● 支持直接搜索板块了\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2094 = "更新内容\n"
            + "● 解决在bbs.nga.cn域名下，无法在帖子里直接查看用户信息的bug\n"
            + "● 解决无法对回复的楼层支持或者反对的bug\n"
            + "● 解决部分图片无法查看大图的bug\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2095 = "更新内容\n"
            + "● 解决无法登陆的问题\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";

    String TIPS_2096 = "更新内容\n"
            + "● 支持长按隐藏浮动按钮\n"
            + "● 支持自适应app图标\n"
            + "● 增加24小时热帖的功能呢\n"
            + "● 修复在三星手机上侧滑返回时界面会闪一下的bug\n"
            + "新版UI有任何bug，建议或意见请私信[@Justwen][@Elrond]\n"
            + "客户端吐槽QQ群:172503242,欢迎加入捡肥皂\n";


}
